//=============================================================================
// StartTP.js
//=============================================================================

/*:
 * @plugindesc Устанавливает TP равным 5
 * @author MiznK
 * @help StartTP.js
 *
 * Этот плагин переопределяет начальное значение TP.
 * Вместо случайного значения от 0 до 25, все персонажи начинают с TP равным 5.
 */

(function () {
  "use strict";

  // Переопределяем функцию инициализации TP
  Game_Battler.prototype.initTp = function () {
    this.setTp(5);
  };
})();
